In [1]:
import numpy as np 
import pandas as pd

In [6]:
df1 = pd.DataFrame({'key':['K0','K1','K2','K3'], 
'A': [1,2,3,4,],
'B' : [5,6,7,8]})
df1

  key  A  B
0  K0  1  5
1  K1  2  6
2  K2  3  7
3  K3  4  8

In [25]:
df2 = pd.DataFrame({'key':['K4','K1','K2','K3','K5'], 'C': [10,20,30,40,50],
'D' : [20,60,70,80,90],
'E' : [15,25,35,45,55]})d
df2

  key   C   D   E
0  K4  10  20  15
1  K1  20  60  25
2  K2  30  70  35
3  K3  40  80  45
4  K5  50  90  55

In [26]:
pd.merge(df1, df2, how = "outer", on = 'key')

  key    A    B     C     D     E
0  K0  1.0  5.0   NaN   NaN   NaN
1  K1  2.0  6.0  20.0  60.0  25.0
2  K2  3.0  7.0  30.0  70.0  35.0
3  K3  4.0  8.0  40.0  80.0  45.0
4  K4  NaN  NaN  10.0  20.0  15.0
5  K5  NaN  NaN  50.0  90.0  55.0

In [27]:
pd.merge(df1, df2, how = 'left',on = 'key')

  key  A  B     C     D     E
0  K0  1  5   NaN   NaN   NaN
1  K1  2  6  20.0  60.0  25.0
2  K2  3  7  30.0  70.0  35.0
3  K3  4  8  40.0  80.0  45.0

In [28]:
pd.merge(df1,df2,how="right",on='key')

  key    A    B   C   D   E
0  K4  NaN  NaN  10  20  15
1  K1  2.0  6.0  20  60  25
2  K2  3.0  7.0  30  70  35
3  K3  4.0  8.0  40  80  45
4  K5  NaN  NaN  50  90  55

In [29]:
pd.merge(df1,df2)

  key  A  B   C   D   E
0  K1  2  6  20  60  25
1  K2  3  7  30  70  35
2  K3  4  8  40  80  45

In [30]:
pd.merge(df2,df1)

  key   C   D   E  A  B
0  K1  20  60  25  2  6
1  K2  30  70  35  3  7
2  K3  40  80  45  4  8

In [31]:
?pd.merge

Signature:
pd.merge(
    left,
    right,
    how: str = 'inner',
    on=None,
    left_on=None,
    right_on=None,
    left_index: bool = False,
    right_index: bool = False,
    sort: bool = False,
    suffixes=('_x', '_y'),
    copy: bool = True,
    indicator: bool = False,
    validate=None,
) -> 'DataFrame'
Docstring:
Merge DataFrame or named Series objects with a database-style join.

The join is done on columns or indexes. If joining columns on
columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
on indexes or indexes on a column or columns, the index will be passed on.
When performing a cross merge, no column specifications to merge on are
allowed.

Parameters
----------
left : DataFrame
right : DataFrame or named Series
    Object to merge with.
how : {'left', 'right', 'outer', 'inner', 'cross'}, default 'inner'
    Type of merge to be performed.

    * left: use only keys from left frame, similar to a SQL left outer join;
      preserve key order.
    * right: use only keys from right frame, similar to a SQL right outer join;
      preserve key order.
    * outer: use union of keys from both frames, similar to a SQL full outer
      join; sort keys lexicographically.
    * inner: use intersection of keys from both frames, similar to a SQL inner
      join; preserve the order of the left keys.
    * cross: creates the cartesian product from both frames, preserves the order
      of the left keys.

      .. versionadded:: 1.2.0

on : label or list
    Column or index level names to join on. These must be found in both
    DataFrames. If `on` is None and not merging on indexes then this defaults
    to the intersection of the columns in both DataFrames.
left_on : label or list, or array-like
    Column or index level names to join on in the left DataFrame. Can also
    be an array or list of arrays of the length of the left DataFrame.
    These arrays are treated as if they are columns.
right_on : label or list, or array-like
    Column or index level names to join on in the right DataFrame. Can also
    be an array or list of arrays of the length of the right DataFrame.
    These arrays are treated as if they are columns.
left_index : bool, default False
    Use the index from the left DataFrame as the join key(s). If it is a
    MultiIndex, the number of keys in the other DataFrame (either the index
    or a number of columns) must match the number of levels.
right_index : bool, default False
    Use the index from the right DataFrame as the join key. Same caveats as
    left_index.
sort : bool, default False
    Sort the join keys lexicographically in the result DataFrame. If False,
    the order of the join keys depends on the join type (how keyword).
suffixes : list-like, default is ("_x", "_y")
    A length-2 sequence where each element is optionally a string
    indicating the suffix to add to overlapping column names in
    `left` and `right` respectively. Pass a value of `None` instead
    of a string to indicate that the column name from `left` or
    `right` should be left as-is, with no suffix. At least one of the
    values must not be None.
copy : bool, default True
    If False, avoid copy if possible.
indicator : bool or str, default False
    If True, adds a column to the output DataFrame called "_merge" with
    information on the source of each row. The column can be given a different
    name by providing a string argument. The column will have a Categorical
    type with the value of "left_only" for observations whose merge key only
    appears in the left DataFrame, "right_only" for observations
    whose merge key only appears in the right DataFrame, and "both"
    if the observation's merge key is found in both DataFrames.

validate : str, optional
    If specified, checks if merge is of specified type.

    * "one_to_one" or "1:1": check if merge keys are unique in both
      left and right datasets.
    * "one_to_many" or "1:m": check if merge keys are unique in left
      dataset.
    * "many_to_one" or "m:1": check if merge keys are unique in right
      dataset.
    * "many_to_many" or "m:m": allowed, but does not result in checks.

Returns
-------
DataFrame
    A DataFrame of the two merged objects.

See Also
--------
merge_ordered : Merge with optional filling/interpolation.
merge_asof : Merge on nearest keys.
DataFrame.join : Similar method using indices.

Notes
-----
Support for specifying index levels as the `on`, `left_on`, and
`right_on` parameters was added in version 0.23.0
Support for merging named Series objects was added in version 0.24.0

Examples
--------
>>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [1, 2, 3, 5]})
>>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [5, 6, 7, 8]})
>>> df1
    lkey value
0   foo      1
1   bar      2
2   baz      3
3   foo      5
>>> df2
    rkey value
0   foo      5
1   bar      6
2   baz      7
3   foo      8

Merge df1 and df2 on the lkey and rkey columns. The value columns have
the default suffixes, _x and _y, appended.

>>> df1.merge(df2, left_on='lkey', right_on='rkey')
  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

Merge DataFrames df1 and df2 with specified left and right suffixes
appended to any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey',
...           suffixes=('_left', '_right'))
  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  foo           5  foo            5
3  foo           5  foo            8
4  bar           2  bar            6
5  baz           3  baz            7

Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
Traceback (most recent call last):
...
ValueError: columns overlap but no suffix specified:
    Index(['value'], dtype='object')

>>> df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
>>> df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})
>>> df1
      a  b
0   foo  1
1   bar  2
>>> df2
      a  c
0   foo  3
1   baz  4

>>> df1.merge(df2, how='inner', on='a')
      a  b  c
0   foo  1  3

>>> df1.merge(df2, how='left', on='a')
      a  b  c
0   foo  1  3.0
1   bar  2  NaN

>>> df1 = pd.DataFrame({'left': ['foo', 'bar']})
>>> df2 = pd.DataFrame({'right': [7, 8]})
>>> df1
    left
0   foo
1   bar
>>> df2
    right
0   7
1   8

>>> df1.merge(df2, how='cross')
   left  right
0   foo      7
1   foo      8
2   bar      7
3   bar      8
File:      c:\users\lidya\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages\pandas\core\reshape\merge.py
Type:      function

JOIN

In [36]:
df3 = pd.DataFrame({'A':[15,25,35,45,105],
'B':[25,65,75,85,205],
'F':[15,25,35,45,55]},index = ['K4','K1','K2','K3','K0'])
df3

      A    B   F
K4   15   25  15
K1   25   65  25
K2   35   75  35
K3   45   85  45
K0  105  205  55

In [37]:
df4 = pd.DataFrame({'C':[10,20,30,40,100],
'D':[20,60,70,80,200],
'E':[1,2,3,4,5]},index = ['K4','K1','K2','K3','K5'])
df4

      C    D  E
K4   10   20  1
K1   20   60  2
K2   30   70  3
K3   40   80  4
K5  100  200  5

In [38]:
df3.join(df4)

      A    B   F     C     D    E
K4   15   25  15  10.0  20.0  1.0
K1   25   65  25  20.0  60.0  2.0
K2   35   75  35  30.0  70.0  3.0
K3   45   85  45  40.0  80.0  4.0
K0  105  205  55   NaN   NaN  NaN

In [39]:
df3.join(df4,how='outer')

        A      B     F      C      D    E
K0  105.0  205.0  55.0    NaN    NaN  NaN
K1   25.0   65.0  25.0   20.0   60.0  2.0
K2   35.0   75.0  35.0   30.0   70.0  3.0
K3   45.0   85.0  45.0   40.0   80.0  4.0
K4   15.0   25.0  15.0   10.0   20.0  1.0
K5    NaN    NaN   NaN  100.0  200.0  5.0

In [40]:
df5 = pd.DataFrame({'key':['K4','K1','K2','K3','K5'], 'C': [10,20,30,40,50],
'D' : [20,60,70,80,90],
'E' : [15,25,35,45,55]})
df5

  key   C   D   E
0  K4  10  20  15
1  K1  20  60  25
2  K2  30  70  35
3  K3  40  80  45
4  K5  50  90  55

In [43]:
df6 = pd.DataFrame({'key':['K0','K1','K2','K3','K5'], 'C': [10,20,30,40,50],
'D' : [25,65,75,85,95],
'E' : [10,20,30,40,50]})
df6

  key   C   D   E
0  K0  10  25  10
1  K1  20  65  20
2  K2  30  75  30
3  K3  40  85  40
4  K5  50  95  50

In [46]:
pd.merge(df5,df6,how = 'left',on='key')

  key  C_x  D_x  E_x   C_y   D_y   E_y
0  K4   10   20   15   NaN   NaN   NaN
1  K1   20   60   25  20.0  65.0  20.0
2  K2   30   70   35  30.0  75.0  30.0
3  K3   40   80   45  40.0  85.0  40.0
4  K5   50   90   55  50.0  95.0  50.0

# Summary
MERGE : 
1. default how = inner
2. nama penghubung boleh beda(on nya.. left_on atau right_on)
3. ketika ada nama kolom yg sama, merge bikin jadi beda. jd C_x, C_y

JOIN : 
1. default how nya join, left join
2. based on nama index yg digabungkan
3. nama kolom gabisa sama antar tabel

CONCAT

In [47]:
df1

  key  A  B
0  K0  1  5
1  K1  2  6
2  K2  3  7
3  K3  4  8

In [48]:
df2

  key   C   D   E
0  K4  10  20  15
1  K1  20  60  25
2  K2  30  70  35
3  K3  40  80  45
4  K5  50  90  55

In [49]:
df2.drop('E',inplace = True,axis = 1)

In [50]:
df2

  key   C   D
0  K4  10  20
1  K1  20  60
2  K2  30  70
3  K3  40  80
4  K5  50  90

In [51]:
#default = axis = 0
pd.concat([df1,df2])

  key    A    B     C     D
0  K0  1.0  5.0   NaN   NaN
1  K1  2.0  6.0   NaN   NaN
2  K2  3.0  7.0   NaN   NaN
3  K3  4.0  8.0   NaN   NaN
0  K4  NaN  NaN  10.0  20.0
1  K1  NaN  NaN  20.0  60.0
2  K2  NaN  NaN  30.0  70.0
3  K3  NaN  NaN  40.0  80.0
4  K5  NaN  NaN  50.0  90.0

In [52]:
pd.concat([df1,df2],axis=1)

   key    A    B key   C   D
0   K0  1.0  5.0  K4  10  20
1   K1  2.0  6.0  K1  20  60
2   K2  3.0  7.0  K2  30  70
3   K3  4.0  8.0  K3  40  80
4  NaN  NaN  NaN  K5  50  90

In [53]:
pd.concat([df1,df2],axis=0)

  key    A    B     C     D
0  K0  1.0  5.0   NaN   NaN
1  K1  2.0  6.0   NaN   NaN
2  K2  3.0  7.0   NaN   NaN
3  K3  4.0  8.0   NaN   NaN
0  K4  NaN  NaN  10.0  20.0
1  K1  NaN  NaN  20.0  60.0
2  K2  NaN  NaN  30.0  70.0
3  K3  NaN  NaN  40.0  80.0
4  K5  NaN  NaN  50.0  90.0

# Latihan Merge, Join, dan Concat
1. Gunakan dataframe / dataset yg kemarin di download dari kaggle
2. Dari dataset tersebut, buatlah dataframe baru dgn ukuran 10x3 sebanyak 2 dataframe
3. lakukan joining (bebas dengan menggunakan merge ataupun join). Lakukan left, right, inner, outer join
4. Tempelkan juga hasil setiap join yang dibuat menjadi 1 dataframe

In [56]:
data = pd.read_csv("expenses data set.csv")
data

,Posting Date,Day of the Week,Amount,Category,Description,Source
0,8/3/18,Friday,-1360.00,Bills,Rent,Chase Debit Card
1,8/4/18,Saturday,-117.89,Groceries,NaN,Chase Debit Card
2,8/4/18,Saturday,-34.27,Merchandise,Makeup/Skin Care,Chase Debit Card
3,8/4/18,Saturday,-21.59,Merchandise,Amazon,Chase Debit Card
4,8/5/18,Sunday,-10.79,Merchandise,Amazon,Chase Debit Card
...,...,...,...,...,...,...
1014,9/30/19,Monday,-420.00,Bills,Rent,Chase Debit Card
1015,9/30/19,Monday,-19.35,Merchandise,Amazon,American Express Credit Card
1016,9/30/19,Monday,-16.14,Merchandise,Clothes,American Express Credit Card
1017,9/30/19,Monday,-10.35,Uber/Lyft,NaN,Chase Debit Card
1018,9/30/19,Monday,-8.63,Merchandise,Amazon,American Express Credit Card

In [57]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1019 entries, 0 to 1018
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Posting Date     1019 non-null   object
 1   Day of the Week  1019 non-null   object
 2   Amount           1019 non-null   float64
 3   Category         1019 non-null   object
 4   Description      506 non-null    object
 5   Source           1019 non-null   object
dtypes: float64(1), object(5)
memory usage: 47.9+ KB

In [67]:
data1 = data.loc[:10,['Posting Date','Amount','Category']]
data1

   Posting Date   Amount       Category
0        8/3/18 -1360.00          Bills
1        8/4/18  -117.89      Groceries
2        8/4/18   -34.27    Merchandise
3        8/4/18   -21.59    Merchandise
4        8/5/18   -10.79    Merchandise
5       8/10/18   -30.78    Merchandise
6       8/11/18   -34.76    Merchandise
7       8/12/18   -12.54    Merchandise
8       8/15/18    -9.98    Merchandise
9       8/16/18  2500.00  Wire Transfer
10      8/24/18   -70.00         Travel

In [74]:
data2 = data.loc[:10,['Day of the Week','Description','Source']]
data2

   Day of the Week       Description            Source
0           Friday              Rent  Chase Debit Card
1         Saturday               NaN  Chase Debit Card
2         Saturday  Makeup/Skin Care  Chase Debit Card
3         Saturday            Amazon  Chase Debit Card
4           Sunday            Amazon  Chase Debit Card
5           Friday            Amazon  Chase Debit Card
6         Saturday           Clothes  Chase Debit Card
7           Sunday            Amazon  Chase Debit Card
8        Wednesday            Amazon  Chase Debit Card
9         Thursday               NaN  Chase Debit Card
10          Friday               NaN  Chase Debit Card

In [75]:
data1.join(data2,how = 'left')

,Posting Date,Amount,Category,Day of the Week,Description,Source
0,8/3/18,-1360.00,Bills,Friday,Rent,Chase Debit Card
1,8/4/18,-117.89,Groceries,Saturday,NaN,Chase Debit Card
2,8/4/18,-34.27,Merchandise,Saturday,Makeup/Skin Care,Chase Debit Card
3,8/4/18,-21.59,Merchandise,Saturday,Amazon,Chase Debit Card
4,8/5/18,-10.79,Merchandise,Sunday,Amazon,Chase Debit Card
5,8/10/18,-30.78,Merchandise,Friday,Amazon,Chase Debit Card
6,8/11/18,-34.76,Merchandise,Saturday,Clothes,Chase Debit Card
7,8/12/18,-12.54,Merchandise,Sunday,Amazon,Chase Debit Card
8,8/15/18,-9.98,Merchandise,Wednesday,Amazon,Chase Debit Card
9,8/16/18,2500.00,Wire Transfer,Thursday,NaN,Chase Debit Card
10,8/24/18,-70.00,Travel,Friday,NaN,Chase Debit Card

In [76]:
data1.join(data2,how = 'right')

,Posting Date,Amount,Category,Day of the Week,Description,Source
0,8/3/18,-1360.00,Bills,Friday,Rent,Chase Debit Card
1,8/4/18,-117.89,Groceries,Saturday,NaN,Chase Debit Card
2,8/4/18,-34.27,Merchandise,Saturday,Makeup/Skin Care,Chase Debit Card
3,8/4/18,-21.59,Merchandise,Saturday,Amazon,Chase Debit Card
4,8/5/18,-10.79,Merchandise,Sunday,Amazon,Chase Debit Card
5,8/10/18,-30.78,Merchandise,Friday,Amazon,Chase Debit Card
6,8/11/18,-34.76,Merchandise,Saturday,Clothes,Chase Debit Card
7,8/12/18,-12.54,Merchandise,Sunday,Amazon,Chase Debit Card
8,8/15/18,-9.98,Merchandise,Wednesday,Amazon,Chase Debit Card
9,8/16/18,2500.00,Wire Transfer,Thursday,NaN,Chase Debit Card
10,8/24/18,-70.00,Travel,Friday,NaN,Chase Debit Card

In [77]:
data1.join(data2,how = 'outer')

,Posting Date,Amount,Category,Day of the Week,Description,Source
0,8/3/18,-1360.00,Bills,Friday,Rent,Chase Debit Card
1,8/4/18,-117.89,Groceries,Saturday,NaN,Chase Debit Card
2,8/4/18,-34.27,Merchandise,Saturday,Makeup/Skin Care,Chase Debit Card
3,8/4/18,-21.59,Merchandise,Saturday,Amazon,Chase Debit Card
4,8/5/18,-10.79,Merchandise,Sunday,Amazon,Chase Debit Card
5,8/10/18,-30.78,Merchandise,Friday,Amazon,Chase Debit Card
6,8/11/18,-34.76,Merchandise,Saturday,Clothes,Chase Debit Card
7,8/12/18,-12.54,Merchandise,Sunday,Amazon,Chase Debit Card
8,8/15/18,-9.98,Merchandise,Wednesday,Amazon,Chase Debit Card
9,8/16/18,2500.00,Wire Transfer,Thursday,NaN,Chase Debit Card
10,8/24/18,-70.00,Travel,Friday,NaN,Chase Debit Card

In [78]:
data1.join(data2,how = 'inner')

,Posting Date,Amount,Category,Day of the Week,Description,Source
0,8/3/18,-1360.00,Bills,Friday,Rent,Chase Debit Card
1,8/4/18,-117.89,Groceries,Saturday,NaN,Chase Debit Card
2,8/4/18,-34.27,Merchandise,Saturday,Makeup/Skin Care,Chase Debit Card
3,8/4/18,-21.59,Merchandise,Saturday,Amazon,Chase Debit Card
4,8/5/18,-10.79,Merchandise,Sunday,Amazon,Chase Debit Card
5,8/10/18,-30.78,Merchandise,Friday,Amazon,Chase Debit Card
6,8/11/18,-34.76,Merchandise,Saturday,Clothes,Chase Debit Card
7,8/12/18,-12.54,Merchandise,Sunday,Amazon,Chase Debit Card
8,8/15/18,-9.98,Merchandise,Wednesday,Amazon,Chase Debit Card
9,8/16/18,2500.00,Wire Transfer,Thursday,NaN,Chase Debit Card
10,8/24/18,-70.00,Travel,Friday,NaN,Chase Debit Card

In [80]:
newdf = pd.DataFrame(np.random.randint(1,100,(5,5)),columns='V W X Y Z'.split())
newdf

    V   W   X   Y   Z
0  84  93  39  44  62
1  48  23  40  62  34
2  57  58  68  24  65
3  83  86  32  85  18
4  23  36  31  94  15

In [150]:
def mod(x):
    return x%2

def times(x):
    return x['V'] * x['X']

In [151]:
newdf[['V','X']].apply(times, axis=1)

0    3276
1    1920
2    3876
3    2656
4     713
dtype: int64

In [82]:
newdf['V'].apply(mod)

0    0
1    0
2    1
3    1
4    1
Name: V, dtype: int64

In [83]:
newdf['V'].apply(lambda x : x%2)

0    0
1    0
2    1
3    1
4    1
Name: V, dtype: int64

In [107]:
newdf.apply(len)

V    5
W    5
X    5
Y    5
Z    5
dtype: int64

In [146]:
def kali (x):
    return x["V"] * x["X"]

In [147]:
newdf[["V","X"]].apply(kali,axis=1)

0    3276
1    1920
2    3876
3    2656
4     713
dtype: int64

In [126]:
newdf

    V   W   X   Y   Z
0  84  93  39  44  62
1  48  23  40  62  34
2  57  58  68  24  65
3  83  86  32  85  18
4  23  36  31  94  15

In [129]:
newdf["V"].apply(lambda x: kali(newdf["V"],newdf["X"]))

      0     1     2     3    4
0  3276  1920  3876  2656  713
1  3276  1920  3876  2656  713
2  3276  1920  3876  2656  713
3  3276  1920  3876  2656  713
4  3276  1920  3876  2656  713

In [125]:
newdf["V"].apply(lambda x : x * newdf["X"])

      0     1     2     3     4
0  3276  3360  5712  2688  2604
1  1872  1920  3264  1536  1488
2  2223  2280  3876  1824  1767
3  3237  3320  5644  2656  2573
4   897   920  1564   736   713

In [122]:
df1

  key  A  B
0  K0  1  5
1  K1  2  6
2  K2  3  7
3  K3  4  8

In [123]:
df1.to_csv('Ini Contoh.csv') # index = False, index gaakan kerekam